[
  {
    "path": "posts/2021-07-16-assignment-dong-fang/",
    "title": "Data Visualization and Analysis for Investigating the Kronos Incident",
    "description": "VAST Challenge 2021 Mini-Challenge 2.",
    "author": [
      {
        "name": "DONG Fang",
        "url": "https://www.linkedin.com/in/reginadongf/"
      }
    ],
    "date": "2021-07-16",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Background1.1 Case overview\r\n1.2 Requirement for Mini-Challenge 2\r\n\r\n2. Data Preparation2.1 Data description\r\n2.2 Step for data preparation\r\n\r\n\r\n1. Background\r\n1.1 Case overview\r\nGAStech is a Tethys-based company having been operating a natural gas production site in the island country of Kronos for over 20 years. It has produced remarkable profits and developed strong relationships with the government of Kronos, but has not been as successful in demonstrating environmental stewardship.\r\nIn January, 2014, the leaders of GAStech are celebrating their new-found fortune as a result of the initial public offering of their very successful company. In the midst of this celebration, several employees of GAStech go missing. An organization known as the Protectors of Kronos (POK) is suspected in the disappearance, but things may not be what they seem.\r\nThis case is designed aim at helping the law enforcement from Kronos and Tethys investigate the incident by using data visualization techniques. There are 3 challenges in VAST Challenge 2021 focusing on different aspects of case analysis. In this report we concentrated on visualization and analysis for Mini-Challenge 2.\r\n1.2 Requirement for Mini-Challenge 2\r\nMany of the Abila, Kronos-based employees of GAStech have company cars which are approved for both personal and business use. Those who do not have company cars have the ability to check out company trucks for business use, but these trucks cannot be used for personal business. The vehicles are installed with GPS tracked periodically as long as they are moving. Besides, in order to promote local businesses, Kronos based companies provide a Kronos Kares benefit card to GASTech employees giving them discounts and rewards in exchange for collecting information about their credit card purchases and preferences as recorded on loyalty cards.\r\nNow the vehicle tracking data for the two weeks prior to the incident, car assignment list, transaction records in credit card and loyal card are available for analyzing.\r\nThe challenges to be dealt with are listed below:\r\nNo.\r\nQuestion\r\n1\r\nUsing just the credit and loyalty card data, identify the most popular locations, and when they are popular. What anomalies do you see? What corrections would you recommend to correct these anomalies?\r\n2\r\nAdd the vehicle data to your analysis of the credit and loyalty card data. How does your assessment of the anomalies in question 1 change based on this new data? What discrepancies between vehicle, credit, and loyalty card data do you find?\r\n3\r\nCan you infer the owners of each credit card and loyalty card? What is your evidence? Where are there uncertainties in your method? Where are there uncertainties in the data?\r\n4\r\nGiven the data sources provided, identify potential informal or unofficial relationships among GASTech personnel. Provide evidence for these relationships.\r\n5\r\nDo you see evidence of suspicious activity? Identify 1- 10 locations where you believe the suspicious activity is occurring, and why.\r\nThe detailed information for Mini-challenge 2 is listed in VAST Challenge 2021 official website.\r\n2. Data Preparation\r\n2.1 Data description\r\nThe dataset used for Mini-Challenge 2 includes 4 CSV files, a package of ESRI shapefiles of Abila and Kronos, and a tourist map of Abila in JPEG format, as shown in the following screenshot.\r\nFig.1 Dataset for visualization and analysis\r\nThe data contents in the CSV files are listed below:\r\nFile\r\nDescription\r\nData Content\r\ncar-assignments.csv\r\nA list of vehicle assignments by employee\r\nEmployee Last Name  Employee First Name  Car ID  Current Employment Type (Department)  Current Employment Title (job title)\r\ngps.csv\r\nvehicle tracking data\r\nTimestamp  Car ID (integer)  Latitude  Longitude\r\ncc_data.csv\r\ncredit and debit card transaction data\r\nTimestamp  Location (name of the business)  Price (real)  Last 4 digits of the credit or debit card number\r\nloyalty_data.csv\r\nloyalty card transaction data\r\nTimestamp  Location (name of the business)  Price (real)  Loyalty Number (A 5-character code starting with L that is unique for each card)\r\n2.2 Step for data preparation\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-16T01:39:28+08:00",
    "input_file": "assignment-dong-fang.knit.md"
  },
  {
    "path": "posts/2021-06-13-proposal/",
    "title": "Interactive Visualization for Exploring Abnormal Tracking and Transaction of GAStech Employee",
    "description": "Project Proposal of VAST Challenge 2021 Mini Challenge 2.",
    "author": [
      {
        "name": "DONG Fang, YIN Xiaolan, ZHANG Youzhen",
        "url": "https://isss608vaag2group3.netlify.app/"
      }
    ],
    "date": "2021-06-13",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Background\r\n2. Motivation\r\n3. Project objectives\r\n4. Proposed Scope and Methodology\r\n5. Project Timeline\r\n6. Storyboard & Visualization Features\r\n7. Software Tools\r\n8. Proposed R Packages\r\n\r\n1. Background\r\nThe IEEE Visual Analytics Science and Technology (VAST) Challenge is an annual contest with the goal of advancing the field of visual analytics through competition. The VAST Challenge is designed to help researchers understand how their software would be used in a novel analytic task and determine if their data transformations, visualizations, and interactions would be beneficial for particular analytic tasks. VAST Challenge 2021 is the so-called Kronos Incident in which several employees of a company named GAStech, located at the island of Kronos went missing. Mini-Challenge 2 aims to find unusual and suspicious behaviors of employees then to make contributions on investigation of the incident.\r\n2. Motivation\r\nThe task of Mini Challenge 2 is to explore anomalies and get meaningful insights to make recommendations for further investigation of the incident. The dataset used here combines geospatial data with aspatial information that allows us to apply geospatial regression techniques and geospatial clustering to understand nutrition and obesity at different geographic granularity.\r\nThe missing, conflicting, and imperfect data gives us chances to use exploratory data analysis techniques to discover patterns, spot anomalies, and check assumptions. We will attempt to link the geographic movement data and consumption data of employees’ credit card purchases and preferences together to provide actionable insights to the analysis.\r\n3. Project objectives\r\nThis project aims to deliver an R-Shiny application that provides:\r\nInteractive user interface design\r\nNutritional information interfaced with a visual chart representation\r\nClustering techniques through both aspatial and geospatial methods\r\nMeaningful and valid insights based on the dataset used\r\n4. Proposed Scope and Methodology\r\nAnalysis of Kronos Incident dataset with background research\r\nExploratory Data Analysis (EDA) methods in R\r\nExploratory Spatial Data Analysis (ESDA) methods in R\r\nClustering methods for aspatial and geospatial information in R\r\nR Markdown development for functionality checks\r\nR-Shiny app development for user interactivity\r\n5. Project Timeline\r\nFig. 1 The project timeline planned\r\n6. Storyboard & Visualization Features\r\nTo be edited after personal assignment complete.\r\n7. Software Tools\r\nGit hub: https://github.com/VisualG2G3/VisualG2Group3\r\nRStudio: https://rstudio.com/\r\n8. Proposed R Packages\r\nClustGeo: https://cran.r-project.org/web/packages/ClustGeo\r\nRColorBrewer: https://cran.r-project.org/web/packages/RColorBrewer\r\nshiny: https://shiny.rstudio.com\r\nshinythemes: https://cran.r-project.org/web/packages/shinythemes\r\nshinyWidgets: https://cran.r-project.org/web/packages/shinyWidgets\r\ntidyverse: https://www.tidyverse.org\r\ntmap: https://cran.r-project.org/web/packages/tmap\r\nsp: https://cran.r-project.org/web/packages/sp\r\nleaflet: https://cran.r-project.org/web/packages/leaflet\r\nplotly: https://cran.r-project.org/web/packages/plotly\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T21:21:44+08:00",
    "input_file": "proposal.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to G2Group3 project",
    "description": "Welcome to our new blog, for VAA_G2_Group3 project. We hope you enjoy reading what we have to say!",
    "author": [
      {
        "name": "DONG Fang, YIN Xiaolan, ZHANG Youzhen",
        "url": "https://isss608vaag2group3.netlify.app/"
      }
    ],
    "date": "2021-06-13",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T21:26:26+08:00",
    "input_file": "welcome.knit.md"
  }
]
